core/app/Http/Controllers/SiteController.php

    public function index()
    {
        $reference = @$_GET['reference'];
        if ($reference) {
            session()->put('reference', $reference);
        }

        $pageTitle = 'Home';
        $sections = Page::where('tempname', $this->activeTemplate)->where('slug', '/')->first();
---
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'favicon.ico' limit 1

    public function pages($slug)
    {
        $page = Page::where('tempname', $this->activeTemplate)->where('slug', $slug)->firstOrFail();
---
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'logs' limit 1

    function products()
    {



        $request = request();
        $request->validate([
            'search' => 'nullable|regex:/^[\w-]*$/'
        ]);

        $categories = Category::active()
            ->whereHas('products', function ($products) {
                return $products->active()->searchable(['name', 'description', 'category:name']);
            })
            ->with(['products' => function ($products) {
                return $products->active()->orderBy('id', 'DESC');
            }, 'products.productDetails']);
---
select * from `product_details` where `product_details`.`product_id` in (27, 33, 34, 35, 44, 45, 50, 51, 66, 67, 69, 70, 71, 72, 73, 74, 76, 77, 79, 80, 83, 84, 89, 90, 98, 99, 100, 101, 102, 103, 104, 105, 106)

        $greetings = $greeting;


        $bought_qty = Bought::count();

        $bought = Bought::latest()->paginate('20');



        $sections = Page::where('tempname', $this->activeTemplate)->where('slug', 'products')->first();
        $gateway_currency = GatewayCurrency::all();
---
select count(*) as aggregate from `boughts`
select * from `boughts` order by `created_at` desc limit 20 offset 0
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'products' limit 1
select * from `gateway_currencies`