core/app/Http/Controllers/User/UserController.php

    public function resloveDeposit(Request $request)
    {
        $pageTitle = 'Reslove Deposit';
        $dep = Deposit::where('trx', $request->trx)->first() ?? null;
---
select * from `deposits` where `trx` = 'EXKT9BYX2JG6' limit 1


        if ($request->bank_type == "opay") {

            $trx = Deposit::where('trx', $request->trx_ref)->first()->status ?? null;
---
select * from `deposits` where `user_id` = 1859 order by `created_at` desc limit 5 offset 0

    public function depositNew(Request $request)
    {
        $pageTitle = 'Fund Wallet';
        $gateway_currency = GatewayCurrency::all();
        $deposits = Deposit::latest()->where('user_id', Auth::id())->with('gateway', 'order')->paginate('5');
---
select * from `gateway_currencies`
select * from `deposits` where `user_id` = 42 order by `created_at` desc limit 5 offset 0
select * from `orders` where `orders`.`id` in (0)
select count(*) as aggregate from `deposits` where `user_id` = 42

    public function orders()
    {
        $pageTitle = 'Orders';

        $orders = Order::where('user_id', auth()->id())
            ->where('status', Status::ORDER_PAID)
            ->searchable(['deposit:trx'])
            ->orderBy('id', 'desc')
            ->with('deposit', 'orderItems')
            ->paginate(getPaginate());


        $count_order = Order::where('user_id', Auth::id())->where('status', 1)->count();
        $order_sum = Order::where('user_id', Auth::id())->where('status', 1)->sum('total_amount');
---
select * from `deposits` where `deposits`.`order_id` in (383)
select * from `order_items` where `order_items`.`order_id` in (383)
select * from `orders` where `user_id` = 42 and `status` = 1 order by `id` desc limit 30 offset 0
select count(*) as aggregate from `orders` where `user_id` = 42 and `status` = 1
select sum(`total_amount`) as aggregate from `orders` where `user_id` = 42 and `status` = 1