core/app/Http/Controllers/User/Auth/RegisterController.php

    public function showRegistrationForm(request $request)
    {


        if ($request->code != null) {

            $email = User::where('referal_code', $request->code)->increment('click_count', 1);
---
select * from `users` where `referal_code` = 1 limit 1
update `users` set `click_count` = `click_count` + 1, `users`.`updated_at` = '2024-05-30 15:55:18' where `referal_code` = '16982'

    protected function create(array $data)
    {



        $general = gs();


        if ($data['code'] != "null") {
            $email = User::where('referal_code', $data['code'])->first()->email;
            $username = User::where('referal_code', $data['code'])->first()->username;
            $get_email = Referre::where('email_2', $data['email'])->first()->email ?? null;

            $ref = new Referre();
            $ref->email = $email;
            $ref->email_2 = trim($data['email']);
            $ref->referer = $username;
            $ref->refrere = trim($data['username']);
            $ref->save();


            User::where('email', $email)->increment('sign_up_count', 1);
---
select * from `users` where `referal_code` = '16982' limit 1
select * from `referres` where `email_2` = 'dinicujy@mailinator.com' limit 1
insert into `referres` (`email`, `email_2`, `referer`, `refrere`, `updated_at`, `created_at`) values ('toluadejimi@gmail.com', 'dinicujy@mailinator.com', 'jimmy2502', 'symax', '2024-05-30 15:54:48', '2024-05-30 15:54:48')
update `users` set `sign_up_count` = `sign_up_count` + 1, `users`.`updated_at` = '2024-05-30 15:54:48' where `email` = 'toluadejimi@gmail.com'

        $user->ts = 0;
        $user->tv = 1;
        $user->profile_complete = 1;
        $user->save();
---
insert into `users` (`email`, `password`, `username`, `country_code`, `mobile`, `address`, `ev`, `sv`, `ts`, `tv`, `profile_complete`, `updated_at`, `created_at`) values ('dinicujy@mailinator.com', '$2y$10$PPxBCUteu1JREKzU.JvXDuHUw7AnTTaU.jadf1xt6Ec7pZy9BkkiW', 'symax', 234, 0, '{\"address\":\"\",\"state\":\"\",\"zip\":\"\",\"country\":null,\"city\":\"\"}', 1, 1, 0, 1, 1, '2024-05-30 15:54:49', '2024-05-30 15:54:49')